# Module 1 - Introducing Libraries: NumPy and Pandas
## Pandas Part 1

### Introduction

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. You have found out that Austin has one of the largest no-kill animal shelters in the country, and they keep meticulous track of animals that have been taken in and released. However, it is a large file, the online visualization tools provided are terrible, the data is sorted as strings, and the file holds an overwhelming amount  of information. Is there an easy way to look at this data? Can we do this with base Python? Is there a better way?


#### _Our goals today are to be able to_: <br/>

- Identify and import Python libraries
- Identify differences between NumPy and base Python in usage and operation
- Import/read data using Pandas
- Identify Pandas objects and manipulate Pandas objects by index and columns
- Filter data using Pandas

#### _Big questions for this lesson_: <br/>
- What is a package, what do packages do, and why might we want to use them?
- When do we want to use NumPy versus Pandas?
- What are the advantages of using Pandas?

### Activation:

![excel](excelpic.jpg)

Most people have used Microsoft Excel or Google sheets. But what are the limitations of excel?

- [Take a minute to read this article](https://www.bbc.com/news/magazine-22223190)
- make a list of problems excel presents

How is using python different?

### 1. Importing Python Libraries


In an earlier lesson, we wrote a function to calculate the mean of an list. That was **tedious**.

Thankfully, other people have wrote and optimized functions and wrapped them into `libraries` we can then call and use in our analysis.

![numpy](https://raw.githubusercontent.com/donnemartin/data-science-ipython-notebooks/master/images/numpy.png)

[NumPy](https://www.numpy.org/) is the fundamental package for scientific computing with Python. 


To import a package type `import` followed by the name of the library as shown below.

In [1]:
import numpy 

x=numpy.array([1,2,3])
print(x)

#most packages have a standard way to import them
import numpy as np

y=np.array([4,5,6])
print(y)

[1 2 3]
[4 5 6]

Because of numpy we can now get the **mean** and other quick math of lists and arrays.

In [2]:
example = [4,3,25,40,62,20]
print(np.mean(example))

25.666666666666668

Now let's import some other packages. We will cover in more detail some fun options for numpy later.

In [3]:
import scipy
import pandas as pd
import matplotlib as mpl

In [ ]:
#sometimes we will want to import a specific module from a library
import matplotlib.pyplot as plt

plt.plot(x,y)

In [ ]:
#OR we can also import it this way

from matplotlib import pyplot as plt 
plt.plot(x,y)

Try importing the seaborn library as ['sns'](https://en.wikipedia.org/wiki/Sam_Seaborn) which is the convention.

In [ ]:
#type your code here!

What happens if we mess with naming conventions? For example, import one of our previous libraries as print.


PLEASE NOTE THAT WE WILL HAVE TO RESET THE KERNEL AFTER RUNNING THIS. Comment out your code after running it.

In [ ]:
#your code here!

In [ ]:
#Did we get an error? What about when we run the following command?

print(x)

#Restart your kernel and clear cells

#### Helpful links: library documenation

Libraries have associated documentation to explain how to use the different tools included in a library.

- [NumPy](https://docs.scipy.org/doc/numpy/)
- [SciPy](https://docs.scipy.org/doc/scipy/reference/)
- [Pandas](http://pandas.pydata.org/pandas-docs/stable/)
- [Matplotlib](https://matplotlib.org/contents.html)

### 2. NumPy versus base Python

Now that we know libraries exist, why do we want to use them? Let us examine a comparison between base Python and Numpy.

Python has lists and normal python can do basic math. NumPy, however, has the helpful objects called arrays.

Numpy has a few advantages over base Python which we will look at.

In [4]:
names_list=['Bob','John','Sally']
names_array=numpy.char.array(['Bob','John','Sally']) #use numpy.array for numbers and numpy.char.array for strings
print(names_list)
print(names_array)

['Bob', 'John', 'Sally']
['Bob' 'John' 'Sally']

In [5]:
# Make a list and an array of three numbers

#your code here
numbers_list = [1, 2, 3]
numbers_array = numpy.array([1, 2, 3])

In [6]:
# divide your array by 2

numbers_array/2

array([0.5, 1. , 1.5])

In [7]:
# divide your list by 2

numbers_list/2

TypeError: unsupported operand type(s) for /: 'list' and 'int'

Numpy arrays support the \_div\_ operator while python lists do not. There are other things that make it useful to utilize numpy over base python for evaluating data.

Below, you will find a piece of code we will use to compare the speed of operations on a list and operations on an array. In this speed test, we will use the library [time](https://docs.python.org/3/library/time.html).

In [8]:
import time
import numpy as np

size_of_vec = 1300000

def pure_python_version():
    t1 = time.time()
    X = range(size_of_vec)
    Y = range(size_of_vec)
    Z = [X[i] + Y[i] for i in range(len(X)) ]
    return time.time() - t1

def numpy_version():
    t1 = time.time()
    X = np.arange(size_of_vec)
    Y = np.arange(size_of_vec)
    Z = X + Y
    return time.time() - t1


t1 = pure_python_version()
t2 = numpy_version()
print("python: " + str(t1), "numpy: "+ str(t2))
print("Numpy is in this example " + str(t1/t2) + " times faster!")

python: 0.3548390865325928 numpy: 0.017703771591186523
Numpy is in this example 20.043135142414652 times faster!

In pairs, run the speed test with a different number, and share your results with the class.

### 3. Importing and reading data with ACTUAL LITERAL Pandas!


![pandas-lib](https://pandas.pydata.org/_static/pandas_logo.png)

![alt text](https://cdn-images-1.medium.com/max/1600/1*oBx032ncOwLmCFX3Epo3Zg.jpeg "https://cdn-images-1.medium.com/max/1600/1*oBx032ncOwLmCFX3Epo3Zg.jpeg")

#### Let's use pandas to read some csv files so we can interact with them.

First, let's check which directory we are in so the files we expect to see are there.

In [9]:
!pwd
!ls -al

/Users/flatironstudentaccount/Desktop/CourseMaterials/Section01/houston-ds-042219-intro_libraries_numpy_and_pandas
total 232
drwxr-xr-x  10 flatironstudentaccount  staff    320 Apr 24 15:52 .
drwxr-xr-x  12 flatironstudentaccount  staff    384 Apr 24 15:31 ..
drwxr-xr-x  13 flatironstudentaccount  staff    416 Apr 24 15:32 .git
drwxr-xr-x   3 flatironstudentaccount  staff     96 Apr 24 15:34 .ipynb_checkpoints
-rw-r--r--   1 flatironstudentaccount  staff     52 Apr 24 15:32 README.md
-rw-r--r--   1 flatironstudentaccount  staff     62 Apr 24 15:32 example1.csv
-rw-r--r--   1 flatironstudentaccount  staff  63117 Apr 24 15:32 excelpic.jpg
-rw-r--r--   1 flatironstudentaccount  staff  30476 Apr 24 15:52 intro_to_libraries_numpy_and_pandas.ipynb
-rw-r--r--   1 flatironstudentaccount  staff   6782 Apr 24 15:32 lesson_plan.md
-rw-r--r--   1 flatironstudentaccount  staff    238 Apr 24 15:32 made_up_jobs.csv

Did you see that? It is possible to run terminal commands from jupyter notebook by using `!`

In [10]:
import pandas as pd
example_csv=pd.read_csv('example1.csv')

There are also `read_excel` and many other pandas `read` functions.

In [11]:
example_csv.head() #this is an example template of how to read a csv

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

Try loading in the example file in the directory called 'made_up_jobs.csv' using pandas.

In [12]:
#read in your csv here!
made_up_jobs = pd.read_csv('made_up_jobs.csv')


#remember that it's nice to be able to look at your data, so let's do that here, too.
made_up_jobs.head()

   ID           Name                       Job  Years Employed
0   0   Bob Bobberty  Underwater Basket Weaver              13
1   1   Susan Smells             Salad Spinner               5
2   2  Alex Lastname      Productivity Manager               2
3   3        Rudy P.                Being cool              55
4   4        Rudy G.  Being compared to Rudy P              50

You can also load in data by using the url of an associated dataset.

In [16]:
shelter_data=pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD') 
#this link is copied directly from the download option for CSV

shelter_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A793389,NaN,04/24/2019 02:33:00 PM,04/24/2019 02:33:00 PM,04/24/2018,Euthanasia,Suffering,Other,Unknown,1 year,Raccoon Mix,Black/Gray
1,A766592,Coco,04/24/2019 02:25:00 PM,04/24/2019 02:25:00 PM,11/12/2016,Return to Owner,NaN,Dog,Intact Male,2 years,Chihuahua Shorthair Mix,Tan/Brown
2,A793355,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Female,1 month,Domestic Shorthair Mix,Tortie/White
3,A793356,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Male,1 month,Domestic Shorthair Mix,Cream Tabby
4,A793358,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Female,1 month,Domestic Shorthair Mix,Blue/Tortie

Now that we can read in data, let's get more comfortable with our Pandas data structures.

In [17]:
type(shelter_data)

pandas.core.frame.DataFrame

In [18]:
ID_series=shelter_data['Animal ID'] #you can specify particular columns in a data frame in this way.

type(ID_series)

pandas.core.series.Series

### 4. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists and dictionary objects?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [19]:
#define your list here!

fruits = ['Apple','Orange','Watermelon','Lemon','Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [20]:
fruits_series = pd.Series(fruits)

print(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index _manually._

In [21]:
ind = ['a','b','c','d','e']

fruits_series = pd.Series(fruits,index=ind)

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [24]:
list_of_lists=[['cat'],['dog'],['horse'],['cow'],['macaw']]

#create custom indices for your series
ind = ['q','w','e','r','t']

#create the series using your list objects
#HINT: use a for loop

list_series = pd.Series(list_of_lists, index=ind)
print(list_series)

#print your series

q      [cat]
w      [dog]
e    [horse]
r      [cow]
t    [macaw]
dtype: object

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [29]:
# Dictionary with list object in values
student_dict = {
    'name' : ['Samantha', 'Alex', 'Dante'],
    'age' : ['35','17','26'],
    'city' : ['Houston', 'Seattle', 'New York']
}

students_df = pd.DataFrame(student_dict)

students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New York

In [30]:
#to find data types of columns
students_df.dtypes

name    object
age     object
city    object
dtype: object

Let's change the data type of ages to int.

In [33]:
students_df.age = students_df['age'].astype(int)

students_df.dtypes

name    object
age      int64
city    object
dtype: object

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [34]:
school_ids = ['1111','1145','0096']

students_df = pd.DataFrame(student_dict,index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New York

Using Pandas, we can also rename column names.

In [44]:
students_df.columns = ['NAME', 'AGE','HOME']
students_df.head()

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New York

Or, we can also change the column names using the rename function.

In [47]:
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New York

Similarly, there is a tool to remove rows and columns from your DataFrame

In [49]:
students_df.drop(columns=['YEARS', 'HOME'])

          NAME
1111  Samantha
1145      Alex
0096     Dante

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

In [38]:
students_df.drop(index=['1111']) #unintuitively, this is a string!

       NAME YEARS      HOME
1145   Alex    17   Seattle
0096  Dante    26  New York

Adding columns can be a bit trickier, however.

#### Getting Started

Let's define a function that returns a dataframe for us to work with. Note that this dataframe is created from a `list` of dictionaries, and each `dict` has identical _keys_ representing field names. The _values_ are the data to be stored in each field.

This list-of-dictionaries format is a common way to represent _rows of data_ in Python.

Pandas is not the only tool that supports it natively: **MongoDB** also represents each row of a dataset as a dictionary. This format is also useful when working with big data in Spark.

In [50]:
def get_customer_data():
    """Return a Pandas DataFrame containing imaginary customer data."""
    customers = [
        {'name': 'Harmony', 'state': 'OR'},
        {'name': 'Sarah', 'state': 'CA'},
        {'name': 'Sharad', 'state': 'WA'},
        {'name': 'CJ', 'state': 'NY'},
        {'name': 'Jerry', 'state': 'OR'},
    ]
    return pd.DataFrame(customers)

In [51]:
get_customer_data()

      name state
0  Harmony    OR
1    Sarah    CA
2   Sharad    WA
3       CJ    NY
4    Jerry    OR

#### Get the customer data

In [52]:
customer_df = get_customer_data()

#### Try to identify all Oregonian customers as hippies:

In [53]:
oregon_customer_df = customer_df[customer_df['state'] == 'OR']
oregon_customer_df['is_hippy'] = 1

/anaconda3/envs/learn-env/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

#### Try to identify all non-Oregonian customers as non-hippies:

In [57]:
non_oregon_customer_df = customer_df[customer_df['state'] != 'OR']
non_oregon_customer_df['is_hippy'] = 0

/anaconda3/envs/learn-env/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

#### We can do the same thing on a single line (and get the same warning):

In [58]:
customer_df[customer_df['state'] == 'OR']['is_hippy'] = 1

/anaconda3/envs/learn-env/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

#### See the results! (What's wrong?)

In [59]:
customer_df

      name state
0  Harmony    OR
1    Sarah    CA
2   Sharad    WA
3       CJ    NY
4    Jerry    OR

#### What went wrong?

1. First, we _sliced_ the original dataframe to include just Oregon customers.
2. The _slice_ `oregon_customer_df` could be interpreted as a _new dataframe_ containing the selected rows in the original `customer_df`, or as a _pointer to_ the rows in the original dataframe. Pandas doesn't know which one we want.
3. When we try to _modify_ or _set_ values in the slice, Pandas doesn't know what to do.

#### One way to avoid the error is to explicitly make a copy of the slice with `df.copy()`:

In [61]:
oregon_customer_df = customer_df[customer_df['state'] == 'OR'].copy()
oregon_customer_df['is_hippy'] = True
oregon_customer_df

      name state  is_hippy
0  Harmony    OR      True
4    Jerry    OR      True

#### What if we really want to modify the original dataframe?
#### We can use `df.loc[columns, rows]` to explicity modify the original dataframe.

In [63]:
customer_df.loc[customer_df['state'] == 'OR', 'is_hippy'] = True
customer_df.loc[customer_df['state'] != 'OR', 'is_hippy'] = False

#### See the awesome results!

In [64]:
customer_df

      name state is_hippy
0  Harmony    OR     True
1    Sarah    CA    False
2   Sharad    WA    False
3       CJ    NY    False
4    Jerry    OR     True

### 5. Filtering data using Pandas

There are several ways to grab particular data from a DataFrame.

We saw the use of loc in the previous example. iloc and loc can be used in a few different ways to access data from a DataFrame.

In [65]:
customer_df.iloc[0] #returns the first row

name        Harmony
state            OR
is_hippy       True
Name: 0, dtype: object

In [66]:
customer_df.iloc[:,0] #returns the first column

0    Harmony
1      Sarah
2     Sharad
3         CJ
4      Jerry
Name: name, dtype: object

In [67]:
customer_df.iloc[0:2] #returns first two rows

      name state is_hippy
0  Harmony    OR     True
1    Sarah    CA    False

In [68]:
customer_df.iloc[:,0:2] #returns the first two columns

      name state
0  Harmony    OR
1    Sarah    CA
2   Sharad    WA
3       CJ    NY
4    Jerry    OR

How would we use indexing to return the last item in the last row?

In [73]:
#return the last item in the last row using indexing

customer_df.iloc[-1, -1]

True

Use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.

In [74]:
students_df

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New York

In [70]:
students_df.loc['1111'] #returns the student information associated with the ID number 1111, which is the index

NAME     Samantha
YEARS          35
HOME      Houston
Name: 1111, dtype: object

In [71]:
students_df.loc[:,'YEARS'] #returns the column labeled 'YEARS'

1111    35
1145    17
0096    26
Name: YEARS, dtype: object

In [72]:
students_df.loc['1111','NAME':'HOME'] #returns information for the row labeled '1111' for columns from 'NAME' to 'HOME'

NAME     Samantha
YEARS          35
HOME      Houston
Name: 1111, dtype: object

How could we return the first and last rows if loc accepts a list of labels?

In [76]:
#return the first and last rows using one loc command

students_df.loc[['1111','0096']]

          NAME YEARS      HOME
1111  Samantha    35   Houston
0096     Dante    26  New York

We can use loc to complete more complicated filtering of our data using boolean indexing.

In [77]:
students_df.loc[students_df['NAME']=='Samantha'] #returns only rows where the name of the student is Samantha

          NAME YEARS     HOME
1111  Samantha    35  Houston

We can also find out which customers in the customer_df DataFrame are not from Oregon. However, I only want to know their names. How would I return this?

In [78]:
customer_df.head()

      name state is_hippy
0  Harmony    OR     True
1    Sarah    CA    False
2   Sharad    WA    False
3       CJ    NY    False
4    Jerry    OR     True

In [81]:
#return the names of customers who are not from Oregon
customer_df.loc[customer_df['state'] != 'OR']

     name state is_hippy
1   Sarah    CA    False
2  Sharad    WA    False
3      CJ    NY    False

Let's select only a single column from a DataFrame. This will create a series, which allows for straightforwards, simple selection of the data it holds.

In [82]:
states=customer_df.loc[:,'state'] #returns a series!!
type(states)

pandas.core.series.Series

In [83]:
states[0:3] #returns the first 3 items

0    OR
1    CA
2    WA
Name: state, dtype: object

In [84]:
states[states=='OR'] #returns 'OR' data and index

0    OR
4    OR
Name: state, dtype: object

Now that we know how to select specific data, we can manipulate those cells. For example, we need to update our customer data because all of our customers in Oregon have moved to New Jersey.

In [90]:
customer_df.loc[customer_df["state"]=='CA'] = 'NJ'

customer_df

      name state is_hippy
0  Harmony    NJ     True
1       NJ    NJ       NJ
2   Sharad    WA    False
3       TJ    NY    False
4    Jerry    NJ     True

Or maybe we got a customer's name wrong and need to change that. Perhaps CJ is actually named TJ. How would we do that?

In [88]:
#return a the customer_df with the fixed name

customer_df.loc[customer_df['name'] == 'CJ'] = 'TJ'
customer_df

      name state is_hippy
0  Harmony    NJ     True
1    Sarah    CA    False
2   Sharad    WA    False
3       TJ    NY    False
4    Jerry    NJ     True

### Lesson Recap

Now that we have all of these new tools in our tool belt, let's take another look at our animal shelter data! 

- Use `shelter_data.columns` to get the list of column names
- Drop columns from the animal shelter data until you have only 5 columns remaining
- Rename those columns
- Get the `unique()` values in outcomes 
- select rows of animals based on an application of boolean indexing

For extra credit: add in your own new column on information to this DataFrame.

In [104]:
shelter_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A793389,NaN,04/24/2019 02:33:00 PM,04/24/2019 02:33:00 PM,04/24/2018,Euthanasia,Suffering,Other,Unknown,1 year,Raccoon Mix,Black/Gray
1,A766592,Coco,04/24/2019 02:25:00 PM,04/24/2019 02:25:00 PM,11/12/2016,Return to Owner,NaN,Dog,Intact Male,2 years,Chihuahua Shorthair Mix,Tan/Brown
2,A793355,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Female,1 month,Domestic Shorthair Mix,Tortie/White
3,A793356,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Male,1 month,Domestic Shorthair Mix,Cream Tabby
4,A793358,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Female,1 month,Domestic Shorthair Mix,Blue/Tortie

In [103]:
shelter_data.columns

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [100]:
smaller_shelter_data = shelter_data.drop(columns = ['Outcome Subtype', 'DateTime', 'MonthYear', 'Sex upon Outcome', 'Animal ID', 'Age upon Outcome', 'Breed'])

smaller_shelter_data.columns

Index(['Name', 'Date of Birth', 'Outcome Type', 'Animal Type', 'Color'], dtype='object')

In [102]:
shelter_data.columns

set(shelter_data['Outcome Type'])

{'Adoption',
 'Died',
 'Disposal',
 'Euthanasia',
 'Missing',
 'Relocate',
 'Return to Owner',
 'Rto-Adopt',
 'Transfer',
 nan}

In [105]:
shelter_data.loc[shelter_data['Animal Type'] == 'Cat']

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
2,A793355,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Female,1 month,Domestic Shorthair Mix,Tortie/White
3,A793356,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Male,1 month,Domestic Shorthair Mix,Cream Tabby
4,A793358,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Female,1 month,Domestic Shorthair Mix,Blue/Tortie
5,A793354,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Female,1 month,Domestic Shorthair Mix,Tortie
6,A793353,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,04/23/2017,Transfer,Partner,Cat,Intact Female,2 years,Domestic Shorthair Mix,Orange Tabby/White
7,A793357,NaN,04/24/2019 01:49:00 PM,04/24/2019 01:49:00 PM,03/15/2019,Transfer,Partner,Cat,Intact Male,1 month,Domestic Shorthair Mix,Orange Tabby
9,A793366,NaN,04/24/2019 12:58:00 PM,04/24/2019 12:58:00 PM,04/23/2016,Return to Owner,NaN,Cat,Intact Male,3 years,Domestic Shorthair Mix,Black/White
12,A793371,NaN,04/24/2019 12:19:00 PM,04/24/2019 12:19:00 PM,04/24/2017,Euthanasia,Suffering,Cat,Intact Male,NaN,Domestic Shorthair Mix,Brown/Black
32,A791238,Luna,04/23/2019 06:39:00 PM,04/23/2019 06:39:00 PM,02/23/2019,Adoption,Foster,Cat,Spayed Female,1 month,Ragdoll Mix,Lynx Point
35,A792171,Jasper,04/23/2019 06:20:00 PM,04/23/2019 06:20:00 PM,10/07/2008,Adoption,NaN,Cat,Neutered Male,10 years,Domestic Medium Hair Mix,Brown Tabby
36,A793345,NaN,04/23/2019 06:15:00 PM,04/23/2019 06:15:00 PM,04/08/2019,Transfer,Partner,Cat,Unknown,2 weeks,Domestic Shorthair Mix,Black
37,A793343,NaN,04/23/2019 06:15:00 PM,04/23/2019 06:15:00 PM,04/08/2019,Transfer,Partner,Cat,Unknown,2 weeks,Domestic Shorthair Mix,Calico
38,A793344,NaN,04/23/2019 06:15:00 PM,04/23/2019 06:15:00 PM,04/08/2019,Transfer,Partner,Cat,Unknown,2 weeks,Domestic Shorthair Mix,Blue
39,A793341,NaN,04/23/2019 06:14:00 PM,04/23/2019 06:14:00 PM,04/21/2019,Transfer,Partner,Cat,Unknown,2 days,Domestic Shorthair Mix,Brown Tabby
40,A793340,NaN,04/23/2019 06:14:00 PM,04/23/2019 06:14:00 PM,04/21/2019,Transfer,Partner,Cat,Unknown,2 days,Domestic Shorthair Mix,Brown Tabby
41,A793338,NaN,04/23/2019 06:14:00 PM,04/23/2019 06:14:00 PM,04/21/2019,Transfer,Partner,Cat,Unknown,2 days,Domestic Shorthair Mix,Brown Tabby
42,A793339,NaN,04/23/2019 06:14:00 PM,04/23/2019 06:14:00 PM,04/21/2019,Transfer,Partner,Cat,Unknown,2 days,Domestic Shorthair Mix,Brown Tabby
43,A793342,NaN,04/23/2019 06:13:00 PM,04/23/2019 06:13:00 PM,04/21/2019,Transfer,Partner,Cat,Unknown,2 days,Domestic Shorthair Mix,Brown Tabby
45,A793301,NaN,04/23/2019 05:54:00 PM,04/23/2019 05:54:00 PM,04/15/2019,Transfer,Partner,Cat,Intact Male,1 weeks,Domestic Shorthair Mix,Cream Tabby
49,A793137,NaN,04/23/2019 04:58:00 PM,04/23/2019 04:58:00 PM,04/20/2018,Died,In Kennel,Cat,Spayed Female,1 year,Domestic Shorthair Mix,Black
50,A792524,NaN,04/23/2019 04:54:00 PM,04/23/2019 04:54:00 PM,01/27/2019,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Shorthair Mix,Brown Tabby
51,A791242,Ruby,04/23/2019 04:44:00 PM,04/23/2019 04:44:00 PM,02/23/2019,Adoption,Foster,Cat,Spayed Female,1 month,Domestic Medium Hair Mix,Brown Tabby
54,A791240,Shadow,04/23/2019 04:33:00 PM,04/23/2019 04:33:00 PM,02/23/2019,Adoption,Foster,Cat,Neutered Male,1 month,Domestic Medium Hair Mix,Black
58,A791241,Simon,04/23/2019 04:11:00 PM,04/23/2019 04:11:00 PM,02/23/2019,Adoption,Foster,Cat,Neutered Male,1 month,Domestic Medium Hair Mix,Black/White
63,A792395,Mia,04/23/2019 03:40:00 PM,04/23/2019 03:40:00 PM,04/10/2018,Adoption,NaN,Cat,Spayed Female,1 year,Domestic Shorthair Mix,Black/White
65,A793157,Randy,04/23/2019 03:00:00 PM,04/23/2019 03:00:00 PM,04/20/2016,Adoption,NaN,Cat,Neutered Male,3 years,Domestic Shorthair Mix,Orange Tabby
66,A793286,Kitty,04/23/2019 02:56:00 PM,04/23/2019 02:56:00 PM,04/23/2015,Return to Owner,NaN,Cat,Intact Female,4 years,Domestic Shorthair Mix,Tortie
82,A793262,NaN,04/23/2019 11:21:00 AM,04/23/2019 11:21:00 AM,04/21/2019,Transfer,Partner,Cat,Unknown,2 days,Domestic Shorthair Mix,Brown Tabby
83,A793263,NaN,04/23/2019 11:21:00 AM,04/23/2019 11:21:00 AM,04/21/2019,Transfer,Partner,Cat,Unknown,2 days,Domestic Shorthair Mix,White/Brown Tabby
84,A793261,*Ophelia,04/23/2019 11:21:00 AM,04/23/2019 11:21:00 AM,04/22/2018,Transfer,Partner,Cat,Intact Female,1 year,Domestic Shorthair Mix,Brown Tabby/White
...,...,...,...,...,...,...,...,...,...,...,...,...
98775,A664059,Sylvia,10/02/2013 01:50:00 PM,10/02/2013 01:50:00 PM,09/28/2005,Return to Owner,NaN,Cat,Spayed Female,8 years,Russian Blue Mix,Blue
98776,A664060,Raisin,10/02/2013 01:49:00 PM,10/02/2013 01:49:00 PM,09/28/2005,Return to Owner,NaN,Cat,Spayed Female,8 years,Domestic Shorthair Mix,Tortie
98781,A657196,*Salamander,10/02/2013 12:05:00 PM,10/02/2013 12:05:00 PM,05/12/2013,Adoption,NaN,Cat,Spayed Female,4 months,Domestic Shorthair Mix,Brown Tabby/White
98783,A661383,*Mirabai,10/02/2013 11:35:00 AM,10/02/2013 11:35:00 AM,08/20/2008,Transfer,Partner,Cat,Spayed Female,5 years,Domestic Shorthair Mix,Calico
98786,A664285,NaN,10/02/2013 11:03:00 AM,10/02/2013 11:03:00 AM,10/01/2013,Died,In Foster,Cat,Intact Male,1 day,Domestic Shorthair Mix,Black
98787,A664284,NaN,10/02/2013 11:02:00 AM,10/02/2013 11:02:00 AM,10/01/2013,Died,In Foster,Cat,Intact Male,1 day,Domestic Shorthair Mix,Black/White
98789,A664329,NaN,10/02/2013 09:21:00 AM,10/02/2013 09:21:00 AM,08/18/2013,Euthanasia,Suffering,Cat,Intact Male,1 month,Domestic Shorthair Mix,Black/White
98792,A664111,*Izzy,10/01/2013 06:54:00 PM,10/01/2013 06:54:00 PM,04/01/2013,Adoption,NaN,Cat,Spayed Female,6 months,Domestic Shorthair Mix,Blue Tabby/White
98793,A664313,NaN,10/01/2013 06:33:00 PM,10/01/2013 06:33:00 PM,09/24/2013,Transfer,Partner,Cat,Intact Female,1 week,Domestic Shorthair Mix,Tortie
98797,A664288,NaN,10/01/2013 06:02:00 PM,10/01/2013 06:02:00 PM,10/01/2011,Euthanasia,Suffering,Cat,Intact Male,2 years,Domestic Shorthair Mix,Blue/White
98798,A661830,Amalia,10/01/2013 05:58:00 PM,10/01/2013 05:58:00 PM,08/25/2012,Transfer,SCRP,Cat,Intact Female,1 year,Domestic Medium Hair Mix,Torbie
98801,A663920,Sparkle,10/01/2013 04:53:00 PM,10/01/2013 04:53:00 PM,07/19/2013,Adoption,NaN,Cat,Spayed Female,2 months,Snowshoe Mix,Blue Point
98802,A661933,*Nutella,10/01/2013 04:49:00 PM,10/01/2013 04:49:00 PM,09/19/2003,Euthanasia,Suffering,Cat,Spayed Female,10 years,Domestic Shorthair Mix,Blue Tabby
98803,A664238,NaN,10/01/2013 04:47:00 PM,10/01/2013 04:47:00 PM,06/01/2013,Euthanasia,Medical,Cat,Unknown,4 months,American Shorthair Mix,Black/White
98804,A660634,*Fauna,10/01/2013 04:17:00 PM,10/01/2013 04:17:00 PM,07/09/2013,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Shorthair,Blue/White
98805,A664218,NaN,10/01/2013 04:11:00 PM,10/01/2013 04:11:00 PM,03/30/2013,Transfer,SCRP,Cat,Neutered Male,6 months,Domestic Medium Hair Mix,Blue Tabby/White
98806,A664217,NaN,10/01/2013 04:11:00 PM,10/01/2013 04:11:00 PM,09/30/2012,Transfer,SCRP,Cat,Intact Female,1 year,Domestic Shorthair Mix,Orange Tabby/White
98807,A663605,*Joe,10/01/2013 04:05:00 PM,10/01/2013 04:05:00 PM,06/06/2013,Return to Owner,NaN,Cat,Neutered Male,3 months,Domestic Shorthair Mix,Brown Tabby/White
98819,A664260,NaN,10/01/2013 01:00:00 PM,10/01/2013 01:00:00 PM,09/10/2013,Transfer,Partner,Cat,Intact Female,3 weeks,Domestic Shorthair Mix,Black/White
98820,A664261,NaN,10/01/2013 01:00:00 PM,10/01/2013 01:00:00 PM,09/10/2013,Transfer,Partner,Cat,Intact Female,3 weeks,Domestic Shorthair Mix,Tortie
98821,A664262,NaN,10/01/2013 12:59:00 PM,10/01/2013 12:59:00 PM,09/22/2013,Transfer,Partner,Cat,Intact Male,1 weeks,Domestic Shorthair Mix,Orange Tabby
98822,A664263,NaN,10/01/2013 12:58:00 PM,10/01/2013 12:58:00 PM,09/22/2013,Transfer,Partner,Cat,Intact Male,1 weeks,Domestic Shorthair Mix,Orange Tabby
98823,A664271,NaN,10/01/2013 12:57:00 PM,10/01/2013 12:57:00 PM,09/24/2013,Transfer,Partner,Cat,Intact Female,1 week,Domestic Shorthair Mix,Orange Tabby
98824,A663495,Pikachu,10/01/2013 12:45:00 PM,10/01/2013 12:45:00 PM,05/19/2013,Return to Owner,NaN,Cat,Spayed Female,4 months,Domestic Shorthair Mix,Torbie
98825,A664219,NaN,10/01/2013 12:34:00 PM,10/01/2013 12:34:00 PM,08/08/2013,Died,In Kennel,Cat,Intact Male,1 month,Domestic Shorthair Mix,Blue/White
98832,A656894,Jake,10/01/2013 11:53:00 AM,10/01/2013 11:53:00 AM,04/22/2013,Adoption,NaN,Cat,Neutered Male,5 months,Domestic Shorthair Mix,Black
98833,A661795,Blakie,10/01/2013 11:53:00 AM,10/01/2013 11:53:00 AM,03/25/2013,Adoption,NaN,Cat,Spayed Female,6 months,Domestic Shorthair Mix,Tortie
98839,A664237,NaN,10/01/2013 10:44:00 AM,10/01/2013 10:44:00 AM,09/24/2013,Transfer,Partner,Cat,Unknown,1 week,Domestic Shorthair Mix,Orange/White
98840,A664236,NaN,10/01/2013 10:44:00 AM,10/01/2013 10:44:00 AM,09/24/2013,Transfer,Partner,Cat,Unknown,1 week,Domestic Shorthair Mix,Orange/White
98841,A664235,NaN,10/01/2013 10:39:00 AM,10/01/2013 10:39:00 AM,09/24/2013,Transfer,Partner,Cat,Unknown,1 week,Domestic Shorthair Mix,Orange/White

## Assessment & Reflection